Table of Contents
 Class ConcreteSetup
Namespace
IdeaRS.OpenModel.Concrete
Assembly
IdeaRS.OpenModel.dll
Concrete setup base class
public abstract class ConcreteSetup : OpenElementId
Inheritance
object
OpenObject
OpenElementId
ConcreteSetup
Derived
ConcreteSetupEc2
Inherited Members
 OpenElementId.Id
 object.Equals(object)
 object.Equals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
 object.ReferenceEquals(object, object)
 object.ToString()
Constructors
 ConcreteSetup()
Constructor
protected ConcreteSetup()
Properties
 SetupValues
Setup values
public List<SetupValue> SetupValues { get; set; }
Property Value
List<SetupValue>
 Edit this page